
var edition = [
  {
    "edition": "V1.0.0_20180511",
    "data": [
      "我的任务列表添加按企业名称搜索功能。",
      "pscc任务审核，结束后判断是否有关联企业未完成pscc任务，没有则企业pscc任务状态为finish。",
      "添加原辅料和工段的对应关系。维护原辅料中sectionId字段。"
    ]
  },
  {
    "edition": "V1.0.1_20180516",
    "data": [
      "排放口信息表-监测排放浓度，加上“非甲烷总烃”字段。",
      "历史任务界面，增加按企业名称，状态搜索，导出功能。",
      "历史任务界面添加详情展现。",
      "修改历史任务列表展现顺序。",
      "增加批量重置用户名功能。"
    ]
  },
  {
    "edition": "V1.0.2_20180518",
    "data": [
      "简表和详表提交时判断是否有工段信息。",
      "修改不是同一项目不能统一分配任务。",
      "修改删除企业任务，关联企业置空。",
      "删除企业时删除与企业相关的所有表格信息。"
    ]
  },
  {
    "edition": "V1.0.3_20180523",
    "data": [
      "修改锅炉不能删除的bug。",
      "修改企业任务审核员进入详情菜单动态配置显示bug。",
      "县（地区，街道）改为 区县",
      "修改后台任务管理任务状态不可修改。",
      "修改详情判断工段未填写不能提交bug",
      "修改基本信息日生产时间段。",
      "污染治理措施，污染物类型增加其他输入项",
      "修复工段产品为0时。列表界面不显示bug。",
      "添加后台和前台菜单对应配置表",
      "修改后台分月数据查询",
      "修改简表、详表基本信息，企业状态为停产时，关停时间显示且为必填项。",
      "根据企业任务状态查询企业",
      "后台更多燃料展现",
      "基本信息添加“用电户号”字段",
      "修改原辅料不能删除的bug"
    ]
  },
  {
    "edition": "V1.0.4_20180530",
    "data": [
      "修改隐藏字段js",
      "提交时判断基本信息是否保存",
      "修改企业任务按修改时间倒序排序",
      "修改职工数量只能输入数字的限制",
      "修复原辅料不能批量删除的bug。",
      "详表基本信息添加年生产小时数（小时）",
      "后台删除隐藏字段，对应配置中，删除该字段。",
      "修改后台审核，如果先选了省，无法选市，需先选择另一个省才可以的bug。",
      "任务管理。项目选择加输入框。",
      "企业列表排序，改为按照最后修改时间进行排序 ，名称改为“修改时间”",
      "增加一个“修改时间”搜索框",
      "添加批量审核名录库功能",
      "企业后台审核，移至详情界面。",
      "修改企业审核列表。市默认不展现",
      "修改汽修、干洗、畜禽养殖、普查表、餐饮后台审核"
    ]
  },
  {
    "edition": "V1.0.5_20180606",
    "data": [
      "新增烟囱数量字段",
      "任务统计添加开始结束时间搜索统计",
      "修改企业审核列表按提交顺序升序排序",
      "添加任务统计，统计整个项目下的所有企业任务数、分区县的企业任务数、分区县的已认领任务数、分区县未认领的任务数、分区县已创建填报任务数量、分区县已认领未创建填报任务的企业数量（即统计选择的企业状态为仅销售/门店/办公、企业实体不存在等4种状态的企业数量）",
      "修改简表工段燃料为下拉选择",
      "企业任务统计功能",
      "修改任务不分配项目，分配任务时出错的bug。",
      "后台导出任务功能",
      "自备发电/供热机组、锅炉信息、炉窑信息和产品信息表的分月信息设置成必填项，提交时相对应分月信息未填写不能提交；",
      "企业状态新增：“新建未投产”一项；同时选择此状态会生成填报任务，基本信息表中企业状态增加“新建未投产”状态",
      "后台企业审核员，企业统计功能",
      "去掉详表简表中一些特殊的字段的筛选框",
      "详表与简表数量单位设置成下拉框选项",
      "online系统已提交企业信息不能编辑"
    ]
  },
  {
    "edition": "V1.0.5_20180613",
    "data": [
      "修改原辅料保存必填项出错的bug。",
      "修改企业任务统计的展现",
      "新增审核员查看已审核通过企业详情功能。",
      "分月信息单位改为下拉选择",
      "修改治理措施污染物类型多选，对应的去除参数显示。",
      "修改提交判断规则，4个表的分月信息如果每个表添加多条信息，可以只填写任意一条信息的分月即可提交"
    ]
  },
  {
    "edition": "V1.0.6_20180623",
    "data": [
      "修改导出pdf，删除临时文件。"
    ]
  },
  {
    "edition": "V1.0.7_20180624",
    "data": [
      "去掉重复企业。"
    ]
  },
  {
    "edition": "V1.0.8_20180702",
    "data": [
      "修改更多燃料单位为下拉框。",
      "企业增加提交时间字段。",
      "修改除简表、详表外。企业信息其他表格不显示产品行业、是否应急、是否错峰选择项。",
      "产品工段红框处添加字段“设备/工序使用状态”。",
      "后台项目经理修改企业名称功能、导出界面企业列表功能。",
      "修改pdf导出产品行业显示转义、pdf增加打印权限。",
      "导出配置表格详情添加搜索框。",
      "增加pdf导出配置，模板套用功能。",
      "修改删除产品、锅炉、工段、原辅料、煤气发生炉、发电机组关联分月信息删除。",
      "修改调查人、调查人联系电话不为企业信息。",
      "添加后台修改企业项目类型功能。",
      "新增企业已提交未审核可以编辑详情。",
      "新增企业审核员可以分配审核企业给子权限成员。",
      "通过搜索条件搜索企业分配审核。",
      "修改任务分配后，如果分配到企业，则直接生成企业信息。",
      "修改工段时间为选择框。",
      "修改企业任务审核员，列表搜索项目只展现分配过的项目。",
      "新增企业审核员可以分配审核企业给子权限成员。",
      "修改原辅料提交判断为必填项。"
    ]
  },
  {
	  "edition": "V1.0.8_20180705",
	  "data": [
		  "提交时判断是否填写原辅料。",
		  "修改导出pdf基本信息，数据保留小数点后6位。",
		  "excel导出模板套用。",
		  "图片旋转放大。"
		  ]
  },
  {
	  "edition": "V1.0.9_20180718",
	  "data": [
		  "导出excel字符转义number为空的判断。",
		  "修改已完成企业直接退回，任务状态改为已处理。",
		  "增 js配置更新版本。",
		  "修改导出pdf开业时间不显示问题。",
		  "后台项目经理修改企业信息。",
		  "导出excel增加企业状态。",
		  "修改多选点击请选择会多一个逗号的问题。"
		  ]
  },
  {
	  "edition": "V1.1.0_20180720",
	  "data": [
		  "1.修复产品工段修改原辅料置空的bug。"
		  ]
  },
  {
	  "edition": "V1.1.1_20180822",
	  "data": [
		  "删除企业信息时如还有其他项目使用，只删除绑定关系。",
		  "分月信息添加和源数据的对比。对比规则（即总量的95%≤分月总量≤总量）",
		  "后台审核预览pdf",
		  "修改提交企业时，已完成企业不能提交",
		  "未通过企业列表不展现编辑按钮。",
		  "详表排污许可是否覆盖显示问：当排污许可选择否时，排污许可证编号、排放许可量默认是灰色的",
		  "审核意见未填写审核不通过按钮不可用",
		  "优化任务分配直接生成企业信息代码",
		  "基本信息字段修改添加",
		  "燃料年份添加",
		  "添加企业审核配置",
		  "修改陕西省西咸新区经纬度独立判断",
		  "提交时产品工段未填写不判断原辅料"
		  ]
  },
]
  