var colors=['#2ec7c9','#b6a2de','#7b7bbb','#5ab1ef','#ffb980','#d87a80','#a9f0e2','#f9dd53','#97b552','#95706d'];
var pollutions = ['SO2','NOx','CO','PM10','PM2.5','BC','OC','NH3','VOCs'];
var sourceType = ['电力生产及供应','民用燃烧','工业生产','机动车','溶剂使用','农业源','扬尘','生物质燃烧','油气储运','固废处理','餐饮'];
var citys = ['成都市','广元市','绵阳市','资阳市','阿坝藏族羌族自治州','达州市','雅安市','甘孜藏族自治州','宜宾市','乐山市','南充市','巴中市','泸州市','凉山彝族自治州','攀枝花市','眉山市','广安市','德阳市','内江市','遂宁市','自贡市'];
var cityMap = {
		'510100':'成都市',
		'510300':'自贡市',
		'510400':'攀枝花市',
		'510500':'泸州市',
		'510600':'德阳市',
		'510700':'绵阳市',
		'510800':'广元市',
		'510900':'遂宁市',
		'511000':'内江市',
		'511100':'乐山市',
		'511300':'南充市',
		'511400':'眉山市',
		'511500':'宜宾市',
		'511600':'广安市',
		'511700':'达州市',
		'511800':'雅安市',
		'511900':'巴中市',
		'512000':'资阳市',
		'513200':'阿坝藏族羌族自治州',
		'513300':'甘孜藏族自治州',
		'513400':'凉山彝族自治州'
}

function getCityName(citycode){
	return cityMap[citycode];
}

function getObjValue(obj,key){
	return (obj == "" || obj == undefined || obj == null) ? 0: parseInt(obj[key]);
}