var colors=['#2ec7c9','#b6a2de','#7b7bbb','#5ab1ef','#ffb980','#d87a80','#a9f0e2','#f9dd53','#97b552','#95706d'];
var citys = ['成都市','广元市','绵阳市','资阳市','阿坝藏族羌族自治州','达州市','雅安市','甘孜藏族自治州','宜宾市','乐山市','南充市',
'巴中市','泸州市','凉山彝族自治州','攀枝花市','眉山市','广安市','德阳市','内江市','遂宁市','自贡市'];
var areas ={
	"四川省":['成都市','广元市','阿坝藏族羌族自治州','资阳市','绵阳市','达州市','自贡市','雅安市','宜宾市','乐山市','南充市','巴中市','泸州市','凉山彝族自治州','攀枝花市','眉山市','广安市','德阳市','内江市','遂宁市','甘孜藏族自治州'],
	"成都市":['锦江区','青羊区','金牛区','武侯区','成华区','高新区','天府新区','龙泉驿区新都区','温江区','双流区','简阳市','都江堰市','邛崃市','彭州市','崇州市','金堂县','郫都区','大邑县','蒲江县','新津县']
}
var classification = ['电力生产及供应','工业生产','机动车','农业源','溶剂使用','生物质燃烧','油气储运','餐饮'];
var pollution = ['SO2','NOx','CO','PM10','PM2.5','BC','OC','NH3','VOCs'];
var enterprise = [
					  {title:"成都生物制品研究所有限责任公司",l:104.015,r:30.513,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"地奥集团成都药业股份有限公司",l:104.683,r:30.683,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都华侨新苑彩印包装有限公司",l:104.0941,r:30.5927777,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"四川新华西乳业有限公司",l:104.68888888888888,r:30.693333333333335,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都全味轩味业有限公司",l:104.68888888888888,r:30.683333333333334,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都友谊包装实业有限公司",l:104.10333333333334,r:30.586666666666666,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都诺迪康生物制药有限公司",l:104.67972222222222,r:30.695,SO2:100,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"四川中烟工业有限责任公司成都卷烟厂",l:104.015,r:30.513,SO2:1000,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都飞机工业（集团）有限责任公司",l:104.683,r:30.683,SO2:10,NOx:200,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:10,VOCs:100},
					  {title:"成都中铁二局铁达商品混凝土有限公司",l:104.0941,r:30.5927777,SO2:10,NOx:20,CO:30,PM10:400,PM25:350,BC:10,OC:10,NH3:10,VOCs:10},
					  {title:"成都市红星电镀有限公司",l:104.68888888888888,r:30.693333333333335,SO2:10,NOx:20,CO:30,PM10:40,PM25:50,BC:10,OC:10,NH3:100,VOCs:210},
					  {title:"成都长峰钢铁集团有限公司",l:104.68888888888888,r:30.683333333333334,SO2:100,NOx:200,CO:300,PM10:400,PM25:350,BC:130,OC:140,NH3:10,VOCs:10},
					  {title:"成都市青白江区日新东方纸厂",l:104.10333333333334,r:30.586666666666666,SO2:310,NOx:204,CO:310,PM10:400,PM25:150,BC:10,OC:10,NH3:110,VOCs:110},
					  {title:"成都长峰钢铁集团有限公司",l:104.67972222222222,r:30.695,SO2:410,NOx:220,CO:310,PM10:440,PM25:150,BC:10,OC:10,NH3:10,VOCs:10}
				];
var data = {
    oriData : [],
    cityToData : {},
    pollutionToData:{},
    //cityArray : [],
    SO2 : [],
    NOx : [], 
    CO : [],
    PM10 : [],
    PM25 : [],
    BC : [],
    OC : [],
    NH3 : [],
    VOCs : []
};

data.format = function (oriData) {
    data.oriData = oriData;
    var city;
    var cityToData = {};
    function pushData(key, city, value) {
        data[key].push({name:city, value:value});
    }
    var singleData;
    for (var i = 0, l = oriData.length; i < l; i++) {
        singleData = oriData[i]
        city = singleData.area;
        cityToData[city] = singleData;
        pushData('SO2', city, singleData.SO2);
        pushData('NOx', city, singleData.NOx);
        pushData('CO', city, singleData.CO);
        pushData('PM10', city, singleData.PM10);
        pushData('PM25', city, singleData.PM25);
        pushData('BC', city, singleData.BC);
        pushData('OC', city, singleData.OC);
        pushData('NH3', city, singleData.NH3);
        pushData('VOCs', city, singleData.VOCs);
    }
    
    function sortData(a, b) {
        return a.value - b.value
    }
    
    data.oriData = oriData;
    data.cityToData = cityToData;
}

var testData=[
		{"area":"成都市","SO2":2000,"NOx":1500,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":1000,"VOCs":1500},
		{"area":"广元市","SO2":1000,"NOx":1000,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"资阳市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"绵阳市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"达州市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"自贡市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"雅安市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"宜宾市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"乐山市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"南充市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"巴中市","SO2":500,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"泸州市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"凉山彝族自治州","SO2":200,"NOx":100,"CO":100,"PM10":1000,"PM25":500,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"攀枝花市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"眉山市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"广安市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"德阳市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"内江市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"遂宁市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"甘孜藏族自治州","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"阿坝藏族羌族自治州","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500},
		{"area":"自贡市","SO2":1000,"NOx":100,"CO":100,"PM10":2000,"PM25":1000,"BC":100,"OC":200,"NH3":300,"VOCs":500}
];

var industyTestData = [
	{"电力生产及供应":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"工业生产":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"机动车":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"农业源":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"溶剂使用":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"生物质燃烧":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"油气储运":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]},
	{"餐饮":[5, 20, 40, 10, 10, 20,5, 20, 40, 10]}
];


var cityCompareTestData =[
	{"电力生产及供应":[10,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"工业生产":[10,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"机动车":[10,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"农业源":[10,10,5,20,5,20, 40, 10, 10, 20,5, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"溶剂使用":[10,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"生物质燃烧":[10,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"油气储运":[30,10,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]},
	{"餐饮":[25,10,5,20,5,20, 40, 10, 10, 20,5, 10, 10, 20,5, 20, 40, 10, 10, 20,5, 20, 40]}
];

var testData2=[
		{'id':'s1','source':'电力生产及供应','SO2':1500,'NOx':200,'CO':1000,'PM10':5000,'PM2.5':2000,'BC':1000,'OC':100,'NH3':200,'VOCs':300},
		{'id':'s2','source':'工业生产','SO2':1000,'NOx':1200,'CO':500,'PM10':2000,'PM2.5':1200,'BC':500,'OC':100,'NH3':3200,'VOCs':3300},
		{'id':'s3','source':'机动车','SO2':2500,'NOx':2100,'CO':1000,'PM10':3000,'PM2.5':2000,'BC':1000,'OC':100,'NH3':200,'VOCs':1300},
		{'id':'s4','source':'农业源','SO2':150,'NOx':120,'CO':100,'PM10':1500,'PM2.5':800,'BC':1000,'OC':100,'NH3':3200,'VOCs':1300},
		{'id':'s5','source':'溶剂使用','SO2':10,'NOx':0,'CO':0,'PM10':1110,'PM2.5':220,'BC':20,'OC':10,'NH3':1200,'VOCs':5300},
		{'id':'s6','source':'生物质燃烧','SO2':3500,'NOx':1200,'CO':1000,'PM10':3000,'PM2.5':2000,'BC':1000,'OC':100,'NH3':0,'VOCs':0},
		{'id':'s7','source':'油气储运','SO2':0,'NOx':200,'CO':0,'PM10':500,'PM2.5':200,'BC':10,'OC':10,'NH3':3200,'VOCs':1300},
		{'id':'s8','source':'餐饮','SO2':1500,'NOx':200,'CO':2000,'PM10':2000,'PM2.5':1000,'BC':1000,'OC':100,'NH3':1200,'VOCs':1300}
]

var testData3 = [
				{"电力生产及供应":[373284.7, 225396.8, 89462.6, 98542.6, 40791.1, 20,50, 40, 1410.9]},
				{"煤炭开采和洗选业":[72614.4, 33090.7, 108780.4, 11859.6, 5596.1, 620,500, 400, 841.4]},
				{"石油加工、炼焦加工业":[1099, 1455.6, 1184.8, 330.1, 84.7, 20, 20, 40, 63]},
				{"化学原料及化学制品制造业":[82224.9, 45073.5, 120212.5, 6728.8,4096.9,20,20, 40, 454.5]},
				{"黑色金属冶炼加工业":[154405.4, 63422.1, 153289.1, 6158.8, 4371.3, 20,20, 40, 463.6]},
				{"非金属矿物制品业":[157401.2, 70896.6, 248640.1,14384.3 ,10135.6, 220, 120, 40, 592.5]},
				{"其它工业行业":[5860.6, 3187.2, 8725.8, 6728.8, 4096.9, 620, 520, 40, 113.1]}
            ];

var testData4 = [
				{"source":"电力生产及供应",'SO2':373284.7, 'NOx':225396.8, 'CO':89462.6, 'PM10':98542.6,'PM2.5': 40791.1,'BC': 20,'OC':50, 'NH3':40, 'VOCs':1410.9},
				{"source":"煤炭开采和洗选业",'SO2':72614.4, 'NOx':33090.7, 'CO':108780.4, 'PM10':11859.6, 'PM2.5':5596.1, 'BC': 620,'OC':500, 'NH3':400, 'VOCs':841.4},
				{"source":"石油加工、炼焦加工业",'SO2':1099, 'NOx':1455.6, 'CO':1184.8,'PM10':330.1,'PM2.5':84.7,'BC':20, 'OC':30,'NH3':40,'VOCs': 63},
				{"source":"化学原料及化学制品制造业",'SO2':82224.9, 'NOx':45073.5, 'CO':120212.5, 'PM10':6728.8,'PM2.5':4096.9,'BC':20,'OC':20, 'NH3':40, 'VOCs':454.5},
				{"source":"黑色金属冶炼加工业",'SO2':154405.4, 'NOx':63422.1, 'CO':153289.1,'PM10': 6158.8, 'PM2.5':4371.3, 'BC': 20,'OC':20, 'NH3':40, 'VOCs':463.6},
				{"source":"非金属矿物制品业",'SO2':157401.2, 'NOx':70896.6, 'CO':248640.1,'PM10':14384.3 ,'PM2.5':10135.6, 'BC': 220, 'OC':120, 'NH3':40, 'VOCs':592.5},
				{"source":"其它工业行业",'SO2':5860.6, 'NOx':3187.2, 'CO':8725.8, 'PM10':6728.8, 'PM2.5':4096.9, 'BC': 620, 'OC':520,'NH3': 40, 'VOCs':113.1}
            ];

var pollutionAbb={
	'SO2' : 'SO2',
	'NOx' : 'NOX', 
	'CO' : 'CO',
	'PM10' : 'PM10',
	'PM2.5' : 'PM25',
	'TSP' : 'TSP',
	'BC' : 'BC',
	'OC' : 'OC',
	'VOCs' : 'VOC',
	'NH3' : 'NH3'
}
									
var thumb1Data=[{
	name:'固定燃烧源',
	SO2:504210.84,
	NOX:587311.67,
	CO:2623884.95,
	PM10:270567.63,
	PM25:201985.69,
	BC:4459.36,
	OC:3822.54,
	VOC:58294.36,
	NH3:2302.22,
	id:1,
	pid:0,
},{
	name:'电厂',
	SO2:102145.82,
	NOX:51860.02,
	CO:23694.21,
	PM10:25081.05,
	PM25:14938.62,
	BC:29.89,
	OC:596.24,
	NH3:1347.09,
	VOC:651.99,
	id:11,
	pid:1,
},{
	name:'工业燃烧',
	SO2:401972.27,
	NOX:486367.15,
	CO:2340593.28,
	PM10:240582.74,
	PM25:183748.72,
	BC:4427.91,
	OC:3222.40,
	NH3:955.13,
	VOC:54764.85,
	id:12,
	pid:1,
},{
	name:'民用源',
	SO2:92.75,
	NOX:49084.50,
	CO:259597.46,
	PM10:4903.84,
	PM25:3298.35,
	BC:1.56,
	OC:3.91,
	NH3:0,
	VOC:2877.52,
	id:13,
	pid:1,
},{
	name:'移动源',
	SO2:9318.29,
	NOX:299465.34,
	CO:677612.60,
	PM10:16767.11,
	PM25:15609.36,
	BC:8162.75,
	OC:2593.92,
	NH3:2885.48,
	VOC:139915.75,
	id:2,
	pid:0,
},{
	name:'道路移动源',
	SO2:3642.61,
	NOX:219598.61,
	CO:620384.98,
	PM10:9057.50,
	PM25:8292.78,
	BC:4009.86,
	OC:1278.68,
	NH3:2885.48,
	VOC:127649.45,
	id:21,
	pid:2,
},{
	name:'非道路移动源',
	SO2:5675.68,
	NOX:79866.74,
	CO:57227.62,
	PM10:7709.61,
	PM25:7316.58,
	BC:4152.89,
	OC:1315.24,
	NH3:0,
	VOC:12266.30,
	id:22,
	pid:2,
},{
	name:'扬尘源',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:287907.81,
	PM25:190597.26,
	BC:331.97,
	OC:3319.72,
	NH3:0,
	VOC:0,
	id:3,
	pid:0,
},{
	name:'工艺过程源',
	SO2:113209.06,
	NOX:79786.41,
	CO:1061121.76,
	PM10:1263658.53,
	PM25:905159.11,
	BC:28306.88,
	OC:35496.21,
	NH3:16838.95,
	VOC:167961.95,
	id:4,
	pid:0,
},{
	name:'有机溶剂使用',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:0,
	PM25:0,
	BC:0,
	OC:0,
	NH3:0,
	VOC:54267.43,
	id:5,
	pid:0,
},{
	name:'存储运输源',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:0,
	PM25:0,
	BC:0,
	OC:0,
	NH3:0,
	VOC:7517.00,
	id:6,
	pid:0,
},{
	name:'农业源',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:0,
	PM25:0,
	BC:0,
	OC:0,
	NH3:668058.24,
	VOC:0,
	id:7,
	pid:0,
},{
	name:'生物质燃烧',
	SO2:7850.66,
	NOX:41890.11,
	CO:554743.00,
	PM10:99425.90,
	PM25:97003.92,
	BC:13257.46,
	OC:55349.41,
	NH3:6760.07,
	VOC:106115.41,
	id:8,
	pid:0,
},{
	name:'废弃物处理源',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:0,
	PM25:0,
	BC:0,
	OC:0,
	NH3:3888.59,
	VOC:11900.77,
	id:9,
	pid:0,
},{
	name:'其他排放源',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:17782.67,
	PM25:14226.14,
	BC:288.97,
	OC:9958.30,
	NH3:0,
	VOC:12447.87,
	id:10,
	pid:0,
},{
	name:'餐饮油烟',
	SO2:0,
	NOX:0,
	CO:0,
	PM10:17782.67,
	PM25:14226.14,
	BC:288.97,
	OC:9958.30,
	NH3:0,
	VOC:12447.87,
	id:101,
	pid:10,
},
]

var thumbCitys=['昆明市','曲靖市','玉溪市','保山市','昭通市','丽江市','普洱市','临沧市','楚雄彝族自治州','红河哈尼族彝族自治州','文山壮族苗族自治州','西双版纳傣族自治州','大理白族自治州','德宏傣族景颇族自治州','怒江傈傈族自治州','迪庆藏族自治州','滇中产业（聚集区）新区'];

var thumb2Data=[
{
	name: '污染物排放',
	data:{
		SO2:[87729.57,145779.2694 ,43538.04,20093.54,122793.49,6771.21,9538.28738,10096.50,16598.03,100838.12,24929.42,3927.84,14663.39,5059.46,3231.52,789.26,18211.90],
		NOX:[146217.86,334344.5433 ,60596.33,36966.40,65618.65,23151.92,30079.75711,30656.19,24368.88,100769.81,41194.04,14284.52,41839.62,24332.59,4172.97,10132.62,19726.82],
		CO:[599803.40,1561675.1221 ,471584.42,206568.23,556946.89,120065.70,156015.465,158186.40,130124.62,264330.95,229969.78,58233.26,216888.49,113264.91,26123.27,39884.97,7696.43],
		PM10:[322616.80,257934.0660 ,214638.94,63637.56,268902.22,105025.07,35767.60681,78218.68,68061.20,268503.30,97806.75,27043.91,72111.65,22112.39,25491.06,7183.68,21054.77],
		PM25:[246918.92,200267.4679 ,136409.75,31304.39,131188.27,79360.70,26892.72235,59243.99,65717.93,220282.34,93214.19,15592.94,51022.65,16591.68,30227.40,3408.64,16937.51],
		OC:[8194.82,20014.6805 ,5519.53,6059.16,7479.02,2357.78,6683.237526,11241.19,7242.27,12740.52,9037.97,2620.50,3744.95,5859.29,748.62,517.30,479.25],
		BC:[5120.48,13164.2196 ,3136.04,2517.54,3217.44,1545.86,1985.990979,3434.91,3933.95,7223.30,3930.87,1385.56,1802.25,1862.55,227.59,273.93,44.93],
		NH3:[58645.60,118291.7798 ,29826.38,39102.09,46717.25,26636.40,32223.20724,39873.04,50185.76,83860.29,68761.79,6420.96,66087.53,14806.66,10187.34,8855.78,251.70],
		VOC:[83379.05,127166.6439 ,30969.42,24735.83,24956.78,11005.02,26628.69369,36226.61,21554.78,58659.90,30132.59,25768.54,24079.84,22905.17,3278.76,6284.20,688.72],
	}
}
]

var thumb3Data=[{
	SO2:'industry/SO2.png',
	NOX:'industry/NOx.png',
	CO:'industry/CO.png',
	PM10:'industry/PM10.png',
	PM25:'industry/PM2.5.png',
	BC:'industry/BC.png',
	OC:'industry/OC.png',
	NH3:'industry/NH3.png',
	VOC:'industry/VOCs.png',
},{
	SO2:'SO2.jpg',
	NOX:'NOx.jpg',
	CO:'CO.jpg',
	PM10:'PM10.jpg',
	PM25:'PM2.5.jpg',
	BC:'BC.jpg',
	OC:'OC.jpg',
	NH3:'NH3.jpg',
	VOC:'VOCs.jpg',
},{
	SO2:'transportation/SO2.png',
	NOX:'transportation/NOx.png',
	CO:'transportation/CO.png',
	PM10:'transportation/PM10.png',
	PM25:'transportation/PM2.5.png',
	BC:'transportation/BC.png',
	OC:'transportation/OC.png',
	NH3:'transportation/NH3.png',
	VOC:'transportation/VOCs.png',
}]

var thumb4Data={}